tutorials/cfdemSolverVoF/waterLevelFluidizedBed/VOF-DEMFluidizedBed/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;//0.008;

vertices
(
    (0. 0. 0.)
    (0.05 0. 0.)
    (0.05 0.05 0.)
    (0. 0.05 0.0)
    (0. 0. 0.05)
    (0.05 0. 0.05)
    (0.05 0.05 0.05)
    (0. 0.05 0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) 	simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
			(3 7 6 2) // back
			(1 5 4 0) // front
			(0 4 7 3) // left 
			(2 6 5 1) // right
			(0 3 2 1) // bottom 
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7) // top 
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
