tutorials/cfdemSolverVoF/waterLevelFluidizedBed/VOF-DEMFluidizedBed/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      Uair;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
		type            fixedValue;
		value uniform (0 0 0);
    }
	
    outlet
    {
        type               pressureInletOutletVelocity;
		value              uniform (0 0 0);
        inletValue         uniform (0 0 0);
    }
	
    walls
    {
		type               noSlip;
    }
	
	frontAndBackPlanes
	{
	    type empty;
	}
}

// ************************************************************************* //
